#include <unistd.h>
#include <stdlib.h>
#include <stdio.h>

int main()
{
	char buf[4096];						// буфер для пересылки по пайпу
	int size;
	int fd[2];

	if (pipe(fd) < 0) {					// вызываем POSIX пайп на массиве из двух целых чисел (в линуксе есть еще свой чуть более продвинутый pipe2)
		printf("pipe failed");
		return -1;
	}

	const pid_t pid = fork();			// форкаемся после пайпа, иначе пайпы не будут связаны между собой

	if (pid < 0) {
		printf("fork failed");
		return -1;
	}

	if (pid) {
		// close(fd[0]);	// дескриптор чтения (имеет смысл закрыть ненужный дескриптор, потому что после форка - это ненужная копия)
		while ((size = read(0, buf, sizeof(buf) - 1)) > 0) { // в родителе читаем из станд.потока ввода (fd = 0)
			buf[size] = '\0';
			printf("Send: %s\n", buf);
			write(fd[1], buf, size);						 // пишем во второй дескриптор пайпа
		}
	} else {
		// close(fd[1]);	// дескриптор записи (имеет смысл закрыть ненужный дескриптор, потому что после форка - это ненужная копия)
		while ((size = read(fd[0], buf, sizeof(buf) - 1)) > 0) {  // в потомке читаем из первого дескриптора пайпа
			buf[size] = '\0';		 	// добавить символ конца строки
			printf("Received: %s\n", buf);
		}
	}

	close(fd[0]);	// хотя можно и тут, видимых эффектов от наличия ненужных дескрипторов в форке не наблюдается
	close(fd[1]);	// и вообще можно не закрывать, само ликвидируется
	return 0;
}
