.text
.global main
main:
    movq %rsp, %rbp #for correct debugging
    
    // В регистре RSI вам дано целое число - градусы по шкале Фаренгейта (TF). Напишите код, 
    //который получит в регистре RSI сответствующее значение по шкале Цельсия (TC). Формула для перевода из шкалы Фаренгейта в шкалу Цельсия:
    //TC=5×(TF−32)/9
    //ВАЖНО:﻿ в качестве операнда инструкций div и mul не может выступать просто число (a. k. a. immediate), т. е. вам придется загрузить 
    //делитель/множитель в регистр и использовать регистр.
    //Так как мы не рассматривали операции с нецелыми числами, нужно отбросить нецелую часть результата и вернуть только целую. 
    //Кроме того гарантируется, что входное число и ответ будут беззнаковыми числами (более формально гарантируется, что 32≤TF≤220.
        
    // input
    movq $40, %RSI      # TF
    
    movq $5, %RAX
    movq $32, %R9
    movq $9, %R10
    
    subq %R9, %RSI      # TF - 32
    mulq %RSI           # %RAX = 5*(TF-32)
    divq %R10           # %RAX = %RAX / 9 , %RDX = %RAX mod 9       
    movq %RAX, %RSI
   
    xorq  %rax, %rax
    ret
